src/cf/Documents/ЗаказПокупателя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>ЗаказПокупателя</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Покупатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПоДокументу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Денежный</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Денежный</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Documents/ЗаказПокупателя/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриОткрытии555(Отказ)

	Сегодня = ТекущаяДата();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	ТекущиеДанныеТаблицы = Элементы.Товары.ТекущиеДанные;
	
	ТекущиеДанныеТаблицы.Цена = 
	ПолучитьЦенуПродажи(ТекущиеДанныеТаблицы.Номенклатура);
	
	//ТекущиеДанныеТаблицы.Сумма =
	//ТекущиеДанныеТаблицы.Цена * ТекущиеДанныеТаблицы.Количество;
	
	ТекущиеДанныеТаблицы.Сумма =
	ОбщегоНазначения_Клиент.РассчитатьСумму(ТекущиеДанныеТаблицы.Цена, ТекущиеДанныеТаблицы.Количество);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЦенуПродажи(Товар)

	Возврат Товар.ЦенаПродажи;

КонецФункции // ПолучитьЦенуПродажи()

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанныеТаблицы = Элементы.Товары.ТекущиеДанные;
	
	//ТекущиеДанныеТаблицы.Сумма =
	//ТекущиеДанныеТаблицы.Цена * ТекущиеДанныеТаблицы.Количество;
	
	ТекущиеДанныеТаблицы.Сумма =
	ОбщегоНазначения_Клиент.РассчитатьСумму(ТекущиеДанныеТаблицы.Цена, ТекущиеДанныеТаблицы.Количество);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	
	Объект.СуммаПоДокументу = Объект.Товары.Итог("Сумма");
	
КонецПроцедуры

&НаКлиенте
Процедура ПокупательОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Объект.Покупатель <> ВыбранноеЗначение Тогда
		Объект.КонтактноеЛицо = "";
	КонецЕсли;	
	
КонецПроцедуры
